In [ ]:
### Show first name, last name, and the full province name of each patient.
### Show patient_id, first_name, last_name from patients whose diagnosis is 'Dementia'.
### Show first name and last name concatinated into one column to show their full name.
### Show how many patients have a birth_date with 2010 as the birth year.
### Show the first_name, last_name, and height of the patient with the greatest height.
### Show all columns for patients who have one of the following patient_ids: 1,45,534,879,1000
### Show the total number of admissions
### Show all the columns from admissions where the patient was admitted and discharged on the same day.
### Show the total number of admissions for patient_id 45.
### Based on the cities that our patients live in, show unique cities that are in province_id 'NS'?
### Write a query to find the first_name, last name and birth date of patients who have height more than 160 and weight more 
### Write a query to find list of patients first_name, last_name, and allergies from Hamilton where allergies are not null
### Show unique birth years from patients and order them by ascending.
### Show unique first names from the patients table which only occurs once in the list.
### Show patient_id and first_name from patients where their first_name start with 'N' and ends with 'y' and is at least 3 
### Display every patient's first_name. Order the list by the length of each name and then by alphbetically.
### Show the total amount of male patients and the total amount of female patients in the patients table.
### Show first and last name, allergies from patients which have allergies to either 'Penicillin' or 'Morphine'. Show results 
### Show patient_id, diagnosis from admissions. Find patients admitted multiple times for the same diagnosis.
### Show the city and the total number of patients in the city.
### Show first name, last name and role of every person that is either patient or physician.
### Show all allergies ordered by popularity. Remove NULL values from query.
### Show all patient's first_name, last_name, and birth_date who were born in the 1970s decade. Sort the list starting from the 
### Separate the last_name and first_name with a comma. Order the list by the first_name in decending order.
### Show the province_id(s), sum of height; where the total sum of its patient's height is greater than or equal to 7,000.
### Show the difference between the largest weight and smallest weight for patients with the last name 'Maroni'.
### Show all of the days of the month (1-31) and how many admission_dates occurred on that day. Sort by the day with most 
### Show all columns for patient_id 45's most recent admission_date.
### Show patient_id, attending_physician_id, and diagnosis for admissions that match one of the given criteria.
### Show first_name, last_name, and the total number of admissions attended for each physician.
### For each physicain, display their id, full name, and the first and last admission date they attended.
### Display the total amount of patients for each province. Order by descending.
### For every admission, display the patient's full name, their admission diagnosis, and their physician's full name who 
### Show all of the patients grouped into weight groups. Show the total amount of patients in each weight group. Order the list 
### Show patient_id, weight, height, isObese from the patients table.
### Show patient_id, first_name, last_name, and attending physician's specialty.
### All patients who have gone through admissions, can see their medical documents on our site. Those patients are given a 
### Each admission costs $50 for patients without insurance, and $10 for patients with insurance. All patients with an even 
### Show the provinces that has more patients identified as 'M' than 'F'. Must only show full province_name
### Show the percent of patients that have 'M' as their gender. Round the answer to the nearest hundreth number and in percent 
### Show patients who borned in or after 2005.
### Show last name of patients that ends with the letter 'A'
### Show the first name of the physician who is the busiest.
### How many Cardiologist are there?
### How many patients admitted in July 2018?
### How many patients stayed for more than 30 days?
### How many patients were diagnosed with Appendicitis?
### What are the top 5 cities having the highest number of patients?
### What are the top 3 allergies patients suffered from?
### What is the average height of male patients from Dundas city?
### What is the average weight of female patients who had Penicillin allergy?
### Update the patients table for the allergies column. If the patient's allergies is `Sulfa` then replace it with `Malar`.

In [139]:
import boto3
import json

%reload_ext sql

def get_secret(secret_name):
    region_name = "us-east-1"
    session = boto3.session.Session()
    client = session.client(
        service_name='secretsmanager',
        region_name=region_name)
    get_secret_value_response = client.get_secret_value(SecretId=secret_name)
    get_secret_value_response = json.loads(get_secret_value_response['SecretString'])
    return get_secret_value_response

db_credentials = get_secret(secret_name='wysde')

USERNAME = db_credentials["RDS_POSTGRES_USERNAME"]
PASSWORD = db_credentials["RDS_POSTGRES_PASSWORD"]
HOST = "database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com"
PORT = 5432
DBNAME = "postgres"
CONN = f"postgresql://{USERNAME}:{PASSWORD}@{HOST}:{PORT}/{DBNAME}"

%sql {CONN}

In [ ]:
SCHEMA = "hospital"
%sql SET search_path = {SCHEMA}

## Easy

### Show first name, last name, and the full province name of each patient.

Example: 'Ontario' instead of 'ON'

In [8]:
%%sql
SELECT
  first_name,
  last_name,
  province_name
FROM patients
  JOIN province_names ON province_names.province_id = patients.province_id
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Velu', 'Galv�n', 'Alberta'),
 ('Derek', 'Nappa', 'Alberta'),
 ('Aniki', 'Leotardo', 'Alberta'),
 ('Leonard', 'Sacrimoni', 'Alberta'),
 ('Reginald', 'Cavor', 'Alberta'),
 ('Laura', 'March', 'British Columbia'),
 ('Lydia', 'Carver', 'British Columbia'),
 ('Annie', 'Smart', 'British Columbia'),
 ('Jackie', 'Dean', 'British Columbia'),
 ('Catherine', 'Minoru', 'British Columbia')]

### Show patient_id, first_name, last_name from patients whose diagnosis is 'Dementia'.

Primary diagnosis is stored in the admissions table.

In [9]:
%%sql
SELECT
  patients.patient_id,
  first_name,
  last_name
FROM patients
  JOIN admissions ON admissions.patient_id = patients.patient_id
WHERE diagnosis = 'Dementia';

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
3 rows affected.

[(160, 'Miranda', 'Delacour'),
 (178, 'David', 'Bustamonte'),
 (207, 'Matt', 'Celine')]

### Show first name and last name concatinated into one column to show their full name.

In [11]:
%%sql
SELECT
  CONCAT(first_name, ' ', last_name) AS full_name
FROM patients
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Donald Waterfield',),
 ('Mickey Baasha',),
 ('Jiji Sharma',),
 ('Blair Diaz',),
 ('Charles Wolfe',),
 ('Sue Falcon',),
 ('Thomas ONeill',),
 ('Sonny Beckett',),
 ('Sister Spitzer',),
 ('Cedric Coltrane',)]

### Show how many patients have a birth_date with 2010 as the birth year.

In [13]:
%%sql
SELECT COUNT(*) AS total_patients
FROM patients
WHERE EXTRACT(YEAR from birth_date) = 2010;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(5,)]

### Show the first_name, last_name, and height of the patient with the greatest height.

In [18]:
%%sql
SELECT * FROM patients LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(1, 'Donald', 'Waterfield', 'M', datetime.datetime(1963, 2, 12, 0, 0), 'Barrie', 'ON', None, 156, 65),
 (2, 'Mickey', 'Baasha', 'M', datetime.datetime(1981, 5, 28, 0, 0), 'Dundas', 'ON', 'Sulfa', 185, 76),
 (3, 'Jiji', 'Sharma', 'M', datetime.datetime(1957, 9, 5, 0, 0), 'Hamilton', 'ON', 'Penicillin', 194, 106),
 (4, 'Blair', 'Diaz', 'M', datetime.datetime(1967, 1, 7, 0, 0), 'Hamilton', 'ON', None, 191, 104),
 (5, 'Charles', 'Wolfe', 'M', datetime.datetime(2017, 11, 19, 0, 0), 'Orillia', 'ON', 'Penicillin', 47, 10),
 (6, 'Sue', 'Falcon', 'F', datetime.datetime(2017, 9, 30, 0, 0), 'Ajax', 'ON', 'Penicillin', 43, 5),
 (7, 'Thomas', 'ONeill', 'M', datetime.datetime(1993, 1, 31, 0, 0), 'Burlington', 'ON', None, 180, 117),
 (8, 'Sonny', 'Beckett', 'M', datetime.datetime(1952, 12, 11, 0, 0), 'Port Hawkesbury', 'NS', None, 174, 105),
 (9, 'Sister', 'Spitzer', 'F', datetime.datetime(1966, 10, 15, 0, 0), 'Toronto', 'ON', 'Penicillin', 173, 95),
 (10, 'Cedric', 'Coltrane', 'M', datetime.datetime(1961, 11, 10, 0, 0), 'Toronto', 'ON', None, 157, 61)]

In [19]:
%%sql
SELECT
  first_name,
  last_name,
  height
FROM patients
WHERE height = (
    SELECT max(height)
    FROM patients
  );

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[('Joe', 'Snyder', 224)]

### Show all columns for patients who have one of the following patient_ids: 1,45,534,879,1000

In [21]:
%%sql
SELECT *
FROM patients
WHERE
  patient_id IN (1, 45, 534, 879, 1000)
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
2 rows affected.

[(1, 'Donald', 'Waterfield', 'M', datetime.datetime(1963, 2, 12, 0, 0), 'Barrie', 'ON', None, 156, 65),
 (45, 'Cross', 'Gordon', 'M', datetime.datetime(2009, 3, 20, 0, 0), 'Ancaster', 'ON', None, 125, 53)]

### Show the total number of admissions

In [22]:
%%sql
SELECT COUNT(*) AS total_admissions
FROM admissions;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(400,)]

### Show all the columns from admissions where the patient was admitted and discharged on the same day.

In [24]:
%%sql
SELECT *
FROM admissions
WHERE admission_date = discharge_date
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(1, datetime.datetime(2018, 9, 20, 0, 0), datetime.datetime(2018, 9, 20, 0, 0), 'Ineffective Breathin Pattern R/T Fluid Accumulatio', 24),
 (9, datetime.datetime(2018, 12, 31, 0, 0), datetime.datetime(2018, 12, 31, 0, 0), 'Ruptured Appendicitis', 19),
 (10, datetime.datetime(2019, 2, 27, 0, 0), datetime.datetime(2019, 2, 27, 0, 0), 'Lower Quadrant Pain', 27),
 (17, datetime.datetime(2019, 3, 4, 0, 0), datetime.datetime(2019, 3, 4, 0, 0), 'Diabetes Mellitus', 9),
 (28, datetime.datetime(2019, 3, 30, 0, 0), datetime.datetime(2019, 3, 30, 0, 0), 'Cancer Of The Stomach', 26),
 (31, datetime.datetime(2018, 9, 26, 0, 0), datetime.datetime(2018, 9, 26, 0, 0), 'Cardiovascular Disease', 19),
 (53, datetime.datetime(2018, 10, 24, 0, 0), datetime.datetime(2018, 10, 24, 0, 0), 'Urinary Tract Infection', 8),
 (54, datetime.datetime(2019, 4, 7, 0, 0), datetime.datetime(2019, 4, 7, 0, 0), 'Hypertension', 21),
 (70, datetime.datetime(2018, 7, 17, 0, 0), datetime.datetime(2018, 7, 17, 0, 0), 'Migraine', 20),
 (78, datetime.datetime(2018, 6, 17, 0, 0), datetime.datetime(2018, 6, 17, 0, 0), 'Hypertension', 17)]

### Show the total number of admissions for patient_id 45.

In [28]:
%%sql
SELECT
  patient_id,
  COUNT(*) AS total_admissions
FROM admissions
WHERE patient_id = 45
GROUP BY patient_id;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(45, 1)]

### Based on the cities that our patients live in, show unique cities that are in province_id 'NS'?

In [29]:
%%sql
SELECT DISTINCT(city) AS unique_cities
FROM patients
WHERE province_id = 'NS';

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
2 rows affected.

[('Halifax',), ('Port Hawkesbury',)]

### Write a query to find the first_name, last name and birth date of patients who have height more than 160 and weight more than 70

In [31]:
%%sql
SELECT first_name, last_name, birth_date FROM patients
WHERE height > 160 AND weight > 70
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Mickey', 'Baasha', datetime.datetime(1981, 5, 28, 0, 0)),
 ('Jiji', 'Sharma', datetime.datetime(1957, 9, 5, 0, 0)),
 ('Blair', 'Diaz', datetime.datetime(1967, 1, 7, 0, 0)),
 ('Thomas', 'ONeill', datetime.datetime(1993, 1, 31, 0, 0)),
 ('Sonny', 'Beckett', datetime.datetime(1952, 12, 11, 0, 0)),
 ('Sister', 'Spitzer', datetime.datetime(1966, 10, 15, 0, 0)),
 ('Rick', 'Bennett', datetime.datetime(1977, 1, 27, 0, 0)),
 ('Amy', 'Leela', datetime.datetime(1977, 6, 25, 0, 0)),
 ('Tom', 'Halliwell', datetime.datetime(1987, 8, 1, 0, 0)),
 ('Rachel', 'Winterbourne', datetime.datetime(1966, 4, 26, 0, 0))]

### Write a query to find list of patients first_name, last_name, and allergies from Hamilton where allergies are not null

In [33]:
%%sql
SELECT
  first_name,
  last_name,
  allergies
FROM patients
WHERE
  city = 'Hamilton'
  and allergies is not null
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Jiji', 'Sharma', 'Penicillin'),
 ('Tom', 'Halliwell', 'Ragweed'),
 ('Nino', 'Andrews', 'Peanuts'),
 ('John', 'Farley', 'Gluten'),
 ('Sam', 'Threep', 'Sulpha'),
 ('Temple', 'Russert', 'Hay Fever'),
 ('Alice', 'Donovan', 'Penicillin'),
 ('Stone', 'Cutting', 'Codeine'),
 ('Phil', 'Chester', 'Penicillin'),
 ('Roland', 'Murphy', 'Sulfa Drugs')]

## Medium

### Show unique birth years from patients and order them by ascending.

In [36]:
%%sql
SELECT
  DISTINCT EXTRACT(YEAR FROM birth_date) AS birth_year
FROM patients
ORDER BY birth_year
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(Decimal('1918'),),
 (Decimal('1923'),),
 (Decimal('1933'),),
 (Decimal('1934'),),
 (Decimal('1938'),),
 (Decimal('1939'),),
 (Decimal('1948'),),
 (Decimal('1949'),),
 (Decimal('1950'),),
 (Decimal('1951'),)]

### Show unique first names from the patients table which only occurs once in the list.

For example, if two or more people are named 'John' in the first_name column then don't include their name in the output list. If only 1 person is named 'Leo' then include them in the output.

In [37]:
%%sql
SELECT first_name
FROM patients
GROUP BY first_name
HAVING COUNT(first_name) = 1
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Moe',),
 ('Mrs',),
 ('Cindy',),
 ('Emil',),
 ('Herr',),
 ('Hercule',),
 ('Nancy',),
 ('Dame',),
 ('Belladonna',),
 ('Shion',)]

### Show patient_id and first_name from patients where their first_name start with 'N' and ends with 'y' and is at least 3 characters long.

In [44]:
%%sql
SELECT
  patient_id,
  first_name
FROM patients
WHERE first_name LIKE 'N_%y'
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
2 rows affected.

[(181, 'Nancy'), (434, 'Nicky')]

### Display every patient's first_name. Order the list by the length of each name and then by alphbetically.

In [47]:
%%sql
SELECT first_name
FROM patients
order by
  LENGTH(first_name),
  first_name
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Bo',),
 ('Abe',),
 ('Abi',),
 ('Amy',),
 ('Amy',),
 ('Amy',),
 ('Amy',),
 ('Ana',),
 ('Ann',),
 ('Ann',)]

### Show the total amount of male patients and the total amount of female patients in the patients table.

Display the two results in the same row.

In [48]:
%%sql
SELECT 
  (SELECT count(*) FROM patients WHERE gender='M') AS male_count, 
  (SELECT count(*) FROM patients WHERE gender='F') AS female_count;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(273, 227)]

### Show first and last name, allergies from patients which have allergies to either 'Penicillin' or 'Morphine'. Show results ordered ascending by allergies then by first_name then by last_name.

In [49]:
%%sql
SELECT
  first_name,
  last_name,
  allergies
FROM patients
WHERE
  allergies IN ('Penicillin', 'Morphine')
ORDER BY
  allergies,
  first_name,
  last_name
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Briareos', 'Hayes', 'Morphine'),
 ('Jon', 'Guarnaccia', 'Morphine'),
 ('Temple', 'Starsmore', 'Morphine'),
 ('Abi', 'Nesmith', 'Penicillin'),
 ('Adam', 'Hecatonchires', 'Penicillin'),
 ('Agatha', 'Sawyer', 'Penicillin'),
 ('Agnes', 'Duckworth', 'Penicillin'),
 ('Alice', 'Donovan', 'Penicillin'),
 ('Amy', 'Fuhrey', 'Penicillin'),
 ('Amy', 'McFly', 'Penicillin')]

### Show patient_id, diagnosis from admissions. Find patients admitted multiple times for the same diagnosis.

In [50]:
%%sql
SELECT
  patient_id,
  diagnosis
FROM admissions
GROUP BY
  patient_id,
  diagnosis
HAVING COUNT(*) > 1
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
2 rows affected.

[(320, 'Pneumonia'), (137, 'Pregnancy')]

### Show the city and the total number of patients in the city.

Order from most to least patients and then by city name ascending.

In [52]:
%%sql
SELECT
  city,
  COUNT(*) AS num_patients
FROM patients
GROUP BY city
ORDER BY num_patients DESC, city asc
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Hamilton', 215),
 ('Burlington', 33),
 ('Toronto', 33),
 ('Brantford', 20),
 ('Stoney Creek', 17),
 ('Ancaster', 14),
 ('Cambridge', 9),
 ('Barrie', 8),
 ('Delhi', 6),
 ('Dundas', 6)]

### Show first name, last name and role of every person that is either patient or physician.

The roles are either "Patient" or "Physician"

In [54]:
%%sql
SELECT first_name, last_name, 'Patient' as role FROM patients
    union
SELECT first_name, last_name, 'Physician' FROM physicians
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Lenny', 'Holmes', 'Patient'),
 ('Vernon', 'Halliwell', 'Patient'),
 ('Charles', 'Wolfe', 'Patient'),
 ('Spiros', 'Mangel', 'Patient'),
 ('Jane', 'Mars', 'Patient'),
 ('Mary', 'Knight', 'Patient'),
 ('Catherine', 'Minoru', 'Patient'),
 ('Maggie', 'Price', 'Patient'),
 ('Bertha', 'Crowley', 'Patient'),
 ('Harry', 'Sofer', 'Patient')]

### Show all allergies ordered by popularity. Remove NULL values from query.

In [56]:
%%sql
SELECT
  allergies,
  COUNT(*) AS total_diagnosis
FROM patients
WHERE
  allergies IS NOT NULL
GROUP BY allergies
ORDER BY total_diagnosis DESC
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Penicillin', 113),
 ('Codeine', 30),
 ('Sulfa', 24),
 ('ASA', 8),
 ('Sulfa Drugs', 7),
 ('Peanuts', 6),
 ('Tylenol', 6),
 ('Valporic Acid', 5),
 ('Wheat', 4),
 ('Hay Fever', 4)]

### Show all patient's first_name, last_name, and birth_date who were born in the 1970s decade. Sort the list starting from the earliest birth_date.

In [57]:
%%sql
SELECT
  first_name,
  last_name,
  birth_date
FROM patients
WHERE
  EXTRACT (YEAR FROM birth_date) BETWEEN 1970 AND 1979
ORDER BY birth_date ASC
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Jadu', 'Principal', datetime.datetime(1970, 3, 28, 0, 0)),
 ('Kenny', 'Skelton', datetime.datetime(1970, 5, 29, 0, 0)),
 ('Temple', 'LoPresti', datetime.datetime(1970, 6, 8, 0, 0)),
 ('Dominic', 'Poppins', datetime.datetime(1971, 2, 18, 0, 0)),
 ('Robbie', 'Wilde', datetime.datetime(1971, 3, 27, 0, 0)),
 ('Richard', 'Davis', datetime.datetime(1971, 8, 3, 0, 0)),
 ('Tom', 'Lovegood', datetime.datetime(1971, 11, 27, 0, 0)),
 ('Joanna', 'Cooper', datetime.datetime(1972, 1, 15, 0, 0)),
 ('Freddie', 'Landsman', datetime.datetime(1972, 3, 16, 0, 0)),
 ('Sarah', 'Daniels', datetime.datetime(1972, 7, 22, 0, 0))]

### Separate the last_name and first_name with a comma. Order the list by the first_name in decending order.

We want to display each patient's full name in a single column. Their last_name in all upper letters must appear first, then first_name in all lower case letters. EX: SMITH,jane

In [59]:
%%sql
SELECT
  CONCAT(UPPER(last_name), ',', LOWER(first_name)) AS new_name_format
FROM patients
ORDER BY first_name DESC
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('MILLER,zoe',),
 ('RIVIERA,woody',),
 ('BASHIR,woody',),
 ('HALE,winnie',),
 ('CLOCK,winnie',),
 ('LARKIN,winifred',),
 ('DINGLE,willie',),
 ('TEMPLIN,william',),
 ('MANU,will',),
 ('VINCENT,wilfred',)]

### Show the province_id(s), sum of height; where the total sum of its patient's height is greater than or equal to 7,000.

In [61]:
%sql select * from patients limit 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(1, 'Donald', 'Waterfield', 'M', datetime.datetime(1963, 2, 12, 0, 0), 'Barrie', 'ON', None, 156, 65),
 (2, 'Mickey', 'Baasha', 'M', datetime.datetime(1981, 5, 28, 0, 0), 'Dundas', 'ON', 'Sulfa', 185, 76),
 (3, 'Jiji', 'Sharma', 'M', datetime.datetime(1957, 9, 5, 0, 0), 'Hamilton', 'ON', 'Penicillin', 194, 106),
 (4, 'Blair', 'Diaz', 'M', datetime.datetime(1967, 1, 7, 0, 0), 'Hamilton', 'ON', None, 191, 104),
 (5, 'Charles', 'Wolfe', 'M', datetime.datetime(2017, 11, 19, 0, 0), 'Orillia', 'ON', 'Penicillin', 47, 10),
 (6, 'Sue', 'Falcon', 'F', datetime.datetime(2017, 9, 30, 0, 0), 'Ajax', 'ON', 'Penicillin', 43, 5),
 (7, 'Thomas', 'ONeill', 'M', datetime.datetime(1993, 1, 31, 0, 0), 'Burlington', 'ON', None, 180, 117),
 (8, 'Sonny', 'Beckett', 'M', datetime.datetime(1952, 12, 11, 0, 0), 'Port Hawkesbury', 'NS', None, 174, 105),
 (9, 'Sister', 'Spitzer', 'F', datetime.datetime(1966, 10, 15, 0, 0), 'Toronto', 'ON', 'Penicillin', 173, 95),
 (10, 'Cedric', 'Coltrane', 'M', datetime.datetime(1961, 11, 10, 0, 0), 'Toronto', 'ON', None, 157, 61)]

In [63]:
%%sql
SELECT
  province_id,
  SUM(height) AS sum_height
FROM patients
GROUP BY province_id
HAVING SUM(height) >= 7000;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[('ON', Decimal('76576'))]

### Show the difference between the largest weight and smallest weight for patients with the last name 'Maroni'.

In [64]:
%%sql
SELECT
  (MAX(weight) - MIN(weight)) AS weight_delta
FROM patients
WHERE last_name = 'Maroni';

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(0,)]

### Show all of the days of the month (1-31) and how many admission_dates occurred on that day. Sort by the day with most admissions to least admissions.

In [67]:
%%sql
SELECT
  EXTRACT (DAY FROM admission_date) AS day_number,
  COUNT(*) AS number_of_admissions
FROM admissions
GROUP BY day_number
ORDER BY number_of_admissions DESC
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(Decimal('2'), 21),
 (Decimal('4'), 19),
 (Decimal('9'), 18),
 (Decimal('18'), 16),
 (Decimal('10'), 16),
 (Decimal('7'), 16),
 (Decimal('12'), 16),
 (Decimal('24'), 15),
 (Decimal('15'), 15),
 (Decimal('25'), 15)]

### Show all columns for patient_id 45's most recent admission_date.

In [70]:
%%sql
SELECT *
FROM admissions
WHERE patient_id = 45
ORDER BY admission_date DESC
LIMIT 1;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(45, datetime.datetime(2018, 11, 15, 0, 0), datetime.datetime(2018, 11, 23, 0, 0), 'Post Partum Hemmorage', 6)]

In [72]:
%%sql
SELECT *
FROM admissions
WHERE
  patient_id = '45'
  AND admission_date = (
    SELECT MAX(admission_date)
    FROM admissions
    WHERE patient_id = '45'
  );

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(45, datetime.datetime(2018, 11, 15, 0, 0), datetime.datetime(2018, 11, 23, 0, 0), 'Post Partum Hemmorage', 6)]

### Show patient_id, attending_physician_id, and diagnosis for admissions that match one of the given criteria.

1. Criteria 1: patient_id is an odd number and attending_physician_id is either 1, 5, or 19.
2. Criteria 2: attending_physician_id contains a 2 and the length of patient_id is 3 characters.

In [100]:
%%sql
SELECT
  patient_id,
  attending_physician_id,
  diagnosis
FROM admissions
WHERE
  (
    attending_physician_id IN (1, 5, 19)
    AND patient_id % 2 != 0
  )
  OR 
  (
    (attending_physician_id::text) LIKE '%2%'
    AND LENGTH(patient_id::text) = 3
  )
  LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(9, 19, 'Ruptured Appendicitis'),
 (13, 1, 'Renal Failure'),
 (15, 5, 'Hiatal Hernia'),
 (31, 19, 'Cardiovascular Disease'),
 (51, 1, 'Undiagnosed Chest Pain'),
 (100, 22, 'Depression, Dementia'),
 (100, 21, 'Respiratory Failure'),
 (103, 22, 'Ovarian Cyst'),
 (103, 2, 'Basal Skull Fracture'),
 (104, 25, 'Abdominal Pain')]

### Show first_name, last_name, and the total number of admissions attended for each physician.

Every admission has been attended by a physician.

In [113]:
%%sql
SELECT
  first_name,
  last_name,
  COUNT(*) as admissions_total
from admissions a
  JOIN physicians ph on ph.physician_id = a.attending_physician_id
GROUP BY first_name, last_name
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Simon', 'Santiago', 17),
 ('Donna', 'Greenwood', 15),
 ('Larry', 'Miller', 16),
 ('Irene', 'Brooks', 6),
 ('Jenny', 'Pulaski', 11),
 ('Ralph', 'Wilson', 18),
 ('Tyrone', 'Smart', 15),
 ('Mickey', 'Duval', 17),
 ('Marie', 'Brinkman', 15),
 ('Miriam', 'Tregre', 12)]

### For each physicain, display their id, full name, and the first and last admission date they attended.

In [116]:
%%sql
SELECT
  physician_id,
  first_name || ' ' || last_name as full_name,
  MIN(admission_date) as first_admission_date,
  MAX(admission_date) as last_admission_date
from admissions a
  JOIN physicians ph on a.attending_physician_id = ph.physician_id
GROUP BY physician_id, full_name
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(1, 'Claude Walls', datetime.datetime(2018, 6, 20, 0, 0), datetime.datetime(2019, 5, 7, 0, 0)),
 (2, 'Joshua Green', datetime.datetime(2018, 6, 26, 0, 0), datetime.datetime(2019, 6, 2, 0, 0)),
 (3, 'Miriam Tregre', datetime.datetime(2018, 6, 10, 0, 0), datetime.datetime(2019, 4, 7, 0, 0)),
 (4, 'James Russo', datetime.datetime(2018, 6, 15, 0, 0), datetime.datetime(2019, 4, 19, 0, 0)),
 (5, 'Scott Hill', datetime.datetime(2018, 6, 28, 0, 0), datetime.datetime(2019, 5, 6, 0, 0)),
 (6, 'Tasha Phillips', datetime.datetime(2018, 8, 2, 0, 0), datetime.datetime(2019, 6, 2, 0, 0)),
 (7, 'Hazel Patterson', datetime.datetime(2018, 6, 20, 0, 0), datetime.datetime(2019, 4, 23, 0, 0)),
 (8, 'Mickey Duval', datetime.datetime(2018, 6, 10, 0, 0), datetime.datetime(2019, 6, 5, 0, 0)),
 (9, 'Jon Nelson', datetime.datetime(2018, 6, 26, 0, 0), datetime.datetime(2019, 4, 10, 0, 0)),
 (10, 'Monica Singleton', datetime.datetime(2018, 6, 18, 0, 0), datetime.datetime(2019, 5, 4, 0, 0))]

### Display the total amount of patients for each province. Order by descending.

In [118]:
%%sql
SELECT
  province_name,
  COUNT(*) as patient_count
FROM patients pa
  join province_names pr on pr.province_id = pa.province_id
GROUP BY pr.province_id, province_name
ORDER BY patient_count desc
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
6 rows affected.

[('Ontario', 480),
 ('Nova Scotia', 6),
 ('British Columbia', 5),
 ('Alberta', 5),
 ('Manitoba', 3),
 ('Saskatchewan', 1)]

### For every admission, display the patient's full name, their admission diagnosis, and their physician's full name who diagnosed their problem.

In [119]:
%%sql
SELECT
  CONCAT(patients.first_name, ' ', patients.last_name) as patient_name,
  diagnosis,
  CONCAT(physicians.first_name,' ',physicians.last_name) as physician_name
FROM patients
  JOIN admissions ON admissions.patient_id = patients.patient_id
  JOIN physicians ON physicians.physician_id = admissions.attending_physician_id
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Dirk Lindley', 'Pain In Abdomen Left Side', 'Claude Walls'),
 ('Annie Smart', 'Cervical Spinal Tumor', 'Claude Walls'),
 ('Hannah MacLeod', 'Chlymidia', 'Claude Walls'),
 ('Marvin Dredd', 'Scatica', 'Claude Walls'),
 ('Cordelia Sugden', 'Active Labour', 'Claude Walls'),
 ('Daniel Nelson', 'Fibromyalgia', 'Claude Walls'),
 ('Naoto Stewart', 'Headache', 'Claude Walls'),
 ('Maria Bluenight', 'Osteoarthritis', 'Claude Walls'),
 ('Joyce Bosch', 'Total Hysterectomy', 'Claude Walls'),
 ('Gala Littlefield', 'Undiagnosed Chest Pain', 'Claude Walls')]

## Hard

### Show all of the patients grouped into weight groups. Show the total amount of patients in each weight group. Order the list by the weight group decending.

For example, if they weight 100 to 109 they are placed in the 100 weight group, 110-119 = 110 weight group, etc.

In [120]:
%%sql
SELECT
  COUNT(*) AS patients_in_group,
  FLOOR(weight / 10) * 10 AS weight_group
FROM patients
GROUP BY weight_group
ORDER BY weight_group DESC
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(3, 140.0),
 (8, 130.0),
 (23, 120.0),
 (45, 110.0),
 (57, 100.0),
 (38, 90.0),
 (52, 80.0),
 (71, 70.0),
 (87, 60.0),
 (40, 50.0)]

### Show patient_id, weight, height, isObese from the patients table.

Display isObese as a boolean 0 or 1.

Obese is defined as weight(kg)/(height(m)2) >= 30.

weight is in units kg.

height is in units cm.

In [122]:
%%sql
SELECT patient_id, weight, height, 
  (CASE 
      WHEN weight/(POWER(height/100.0,2)) >= 30 THEN
          1
      ELSE
          0
      END) AS isObese
FROM patients
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(1, 65, 156, 0),
 (2, 76, 185, 0),
 (3, 106, 194, 0),
 (4, 104, 191, 0),
 (5, 10, 47, 1),
 (6, 5, 43, 0),
 (7, 117, 180, 1),
 (8, 105, 174, 1),
 (9, 95, 173, 1),
 (10, 61, 157, 0)]

### Show patient_id, first_name, last_name, and attending physician's specialty.

Show only the patients who has a diagnosis as 'Hypertension' and the physician's first name is 'Lisa'

Check patients, admissions, and physicians tables for required information.

In [135]:
%%sql
SELECT
  p.patient_id,
  p.first_name AS patient_first_name,
  p.last_name AS patient_last_name,
  ph.specialty AS attending_physician_specialty
FROM patients p
  JOIN admissions a ON a.patient_id = p.patient_id
  JOIN physicians ph ON ph.physician_id = a.attending_physician_id
WHERE
  ph.first_name = 'Lisa' and
  a.diagnosis = 'Hypertension';

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
2 rows affected.

[(54, 'Molly', 'Jackson', 'Obstetrician/Gynecologist'),
 (324, 'Mary', 'Matthews', 'Obstetrician/Gynecologist')]

### All patients who have gone through admissions, can see their medical documents on our site. Those patients are given a temporary password after their first admission. Show the patient_id and temp_password.

The password must be the following, in order:
1. patient_id
2. the numerical length of patient's last_name
3. year of patient's birth_date

In [143]:
%%sql
SELECT
  DISTINCT P.patient_id,
  CONCAT(
    P.patient_id,
    LENGTH(last_name),
    EXTRACT (YEAR from birth_date)
  ) AS temp_password
FROM patients P
  JOIN admissions A ON A.patient_id = P.patient_id
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(244, '24481986'),
 (64, '6441957'),
 (155, '15591989'),
 (47, '4791979'),
 (339, '33971986'),
 (40, '4071953'),
 (9, '971966'),
 (82, '8271990'),
 (39, '3982016'),
 (6, '662017')]

### Each admission costs $50 for patients without insurance, and $10 for patients with insurance. All patients with an even patient_id have insurance.

Give each patient a 'Yes' if they have insurance, and a 'No' if they don't have insurance. Add up the admission_total cost for each has_insurance group.

In [144]:
%%sql
SELECT 
CASE WHEN patient_id % 2 = 0 Then 
    'Yes'
ELSE 
    'No' 
END as has_insurance,
SUM(CASE WHEN patient_id % 2 = 0 Then 
    10
ELSE 
    50 
END) as cost_after_insurance
FROM admissions 
GROUP BY has_insurance;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
2 rows affected.

[('No', 9850), ('Yes', 2030)]

### Show the provinces that has more patients identified as 'M' than 'F'. Must only show full province_name

In [145]:
%%sql
SELECT pr.province_name
FROM patients AS pa
  JOIN province_names AS pr ON pa.province_id = pr.province_id
GROUP BY pr.province_name
HAVING
  COUNT( CASE WHEN gender = 'M' THEN 1 END) > COUNT( CASE WHEN gender = 'F' THEN 1 END)
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
5 rows affected.

[('Manitoba',),
 ('Nova Scotia',),
 ('Alberta',),
 ('Ontario',),
 ('Saskatchewan',)]

### Show the percent of patients that have 'M' as their gender. Round the answer to the nearest hundreth number and in percent form.

In [148]:
%%sql
SELECT
  round(100 * avg(CASE WHEN  gender = 'M' THEN 1 ELSE 0 END), 2) || '%' AS percent_of_male_patients
FROM
  patients;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[('54.60%',)]

## Question set

### Show patients who borned in or after 2005.

In [149]:
%%sql
SELECT *
FROM patients
WHERE EXTRACT(YEAR from birth_date) >= 2005
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(5, 'Charles', 'Wolfe', 'M', datetime.datetime(2017, 11, 19, 0, 0), 'Orillia', 'ON', 'Penicillin', 47, 10),
 (6, 'Sue', 'Falcon', 'F', datetime.datetime(2017, 9, 30, 0, 0), 'Ajax', 'ON', 'Penicillin', 43, 5),
 (30, 'Roderick', 'Payne', 'M', datetime.datetime(2015, 3, 22, 0, 0), 'Halifax', 'NS', None, 58, 17),
 (32, 'Bertha', 'Crowley', 'F', datetime.datetime(2009, 3, 14, 0, 0), 'Delhi', 'ON', None, 125, 39),
 (35, 'Anthony', 'Maxwell', 'M', datetime.datetime(2011, 2, 11, 0, 0), 'Oakville', 'ON', None, 92, 37),
 (38, 'Kelly', 'Hamilton', 'F', datetime.datetime(2010, 9, 29, 0, 0), 'Stoney Creek', 'ON', 'Penicillin', 84, 36),
 (39, 'Charles', 'Andonuts', 'M', datetime.datetime(2016, 5, 20, 0, 0), 'Hamilton', 'ON', None, 62, 15),
 (43, 'Stone', 'Cutting', 'M', datetime.datetime(2010, 9, 24, 0, 0), 'Hamilton', 'ON', 'Codeine', 110, 42),
 (45, 'Cross', 'Gordon', 'M', datetime.datetime(2009, 3, 20, 0, 0), 'Ancaster', 'ON', None, 125, 53),
 (50, 'Phil', 'Beckett', 'M', datetime.datetime(2014, 10, 11, 0, 0), 'Ottawa', 'ON', None, 83, 26)]

### Show last name of patients that ends with the letter 'A'

In [151]:
%%sql
SELECT
  last_name
FROM
  patients
WHERE
  last_name LIKE '%a'
LIMIT 10;

 * postgresql://postgres:***@database-1.cy8ltogyfgas.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Baasha',),
 ('Sharma',),
 ('Leela',),
 ('Kobayakawa',),
 ('Riviera',),
 ('Riviera',),
 ('Provenza',),
 ('Baasha',),
 ('Scarpetta',),
 ('Luca',)]

### Show the first name of the physician who is the busiest.

### How many Cardiologist are there?

### How many patients admitted in July 2018?

### How many patients stayed for more than 30 days?

### How many patients were diagnosed with Appendicitis?

### What are the top 5 cities having the highest number of patients?

### What are the top 3 allergies patients suffered from?

### What is the average height of male patients from Dundas city?

### What is the average weight of female patients who had Penicillin allergy?

### Update the patients table for the allergies column. If the patient's allergies is `Sulfa` then replace it with `Malar`.